Repository: 84000/data-translation-memory
Catalog: toh57-v3.tmx
Source language: bo
Languages: en

source: འདི་སྐད་དུ་དགེ་སྦྱོང་གཽ་ཏ་མ་ནི་བདག་གི་སྟོན་པ་ཆེན་པོ་ཡིན་ནོ། །ཞེས་མ་ཟེར་བར་ངས་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་ཆོས་གང་ཡིན་པ་དེ་གཅིག་པུ་དབེན་པར་སོང་ལ་ཡིད་ལ་བསམས་ཏེ།
en: Without saying, ‘The śramaṇa Gautama is my great teacher,’ go to a lonely place and reflect upon the phenomena to which I have completely awakened.

source: འཇལ་བར་གྱིས་ཤིག །
en: Weigh them.

source: སོ་སོར་རྟོགས་ཤིག །
en: Analyze them.

source: རྟག་པར་མང་དུ་སྒོམས་ཤིག །
en: Always meditate a great deal.

source: སེམས་རྩེ་གཅིག་ཏུ་ཆོས་རྣམས་སོ་སོར་བརྟགས་ཏེ། ཆོས་དེ་དག་ལས་བསྒོམ་པའི་འདུ་ཤེས་ཡོངས་སུ་རྫོགས་པར་བྱས་ཏེ། ཡང་དག་པའི་དྲན་པ་ལ་གནས་ནས་བདག་ཉིད་ཀྱི་གླིང་བྱོས་ཤིག །
en: Having analyzed those phenomena with one-pointedness of mind and having perfected your perceptions through meditation on those phenomena, established in perfect mindfulness, be your own island.

source: བདག་ཉིད་ཀྱི་གནས་དང་། སྐྱབས་བྱོས་ཤིག །
en: Be your own abode and refuge.

source: ཆོས་ཀྱི་གླིང་བྱོས་ཤིག །
en: Make an island of the Dharma.

source: ཆོས་ཀྱི་གནས་དང་སྐྱབས་བྱོས་ཤིག་དང་།
en: Make an abode and a refuge of the Dharma.

source: དེ་ལས་གཞན་པའི་གླིང་དང་། གནས་དང་། སྐྱབས་མེད་དོ། །
en: There is no island or abode or refuge other than this.

source: དགའ་བོ་ཇི་ལྟར་ན་དགེ་སློང་བདག་ཉིད་གླིང་དུ་གྱུར་པ་དང་། བདག་ཉིད་གནས་དང་། སྐྱབས་སུ་གྱུར་པ་དང་། ཆོས་གླིང་དུ་གྱུར་པ་དང་། ཆོས་གནས་དང་སྐྱབས་སུ་གྱུར་ཅིང་དེ་ལས་གཞན་པའི་གླིང་དང་།
en: Nanda, how can a śramaṇa have himself as an island, or himself as an abode, or himself as a refuge, or have the Dharma as an island, or the Dharma as an abode or refuge, and how can there be no island other than those, or no abode other than those, or no refuge other than those?

source: དེ་ལས་གཞན་པའི་གནས་དང་། སྐྱབས་མེད་པར་གྱུར་པ་ཡིན་ཞེ་ན། དགའ་བོ་འདི་ལྟར་དགེ་སློང་གང་ལ་ལ་ཞིག་བདག་ཉིད་ཀྱི་ནང་གི་ལུས་ལ་ལུས་ཀྱི་རྗེས་སུ་ལྟ་བ་ལ་རབ་ཏུ་གནས་ནས་བརྩོན་འགྲུས་ཀྱི་དྲན་པ་རྩེ་གཅིག་ཏུ་བྱས་པས་ཡང་དག་པའི་ཤེས་པ་ཐོབ་ནས་འཇིག་རྟེན་པའི་ཁོང་ཁྲོ་བ་ཇི་སྙེད་པ་དག་རྟག་ཏུ་ཡིད་ལ་སེམས་ཤིང་རབ་ཏུ་དུལ་བར་གྱུར་པ་གང་ཡིན་པ་དེ་ནི་ནང་གི་ལུས་ལ་ལུས་ཀྱི་རྗེས་སུ་ལྟ་བ་ཞེས་བྱ་སྟེ།
en: Nanda, it is like this: a śramaṇa who is well established in observation of the body with respect to his own internal body, and is diligently engaged in one-pointed mindfulness, obtains perfect understanding, never has in mind whatever anger he has for the world, and is completely disciplined.

source: གང་གིས་ཕྱི་རོལ་གྱི་ལུས་དང་།
en: That is known as observation of suffering with respect to the internal body.

source: ནང་དང་ཕྱི་རོལ་དང་གཉི་གའི་ལུས་ལ་རྗེས་སུ་ལྟ་བ་ཡང་དེ་བཞིན་ནོ། །
en: It is similar for one who observes the external body or both the internal and external bodies.

source: དགའ་བོ་དེའི་འོག་ཏུ་ཀུན་འབྱུང་བའི་ཆོས་ལ་ལུས་སུ་བལྟས་ནས་རབ་ཏུ་གནས་པ་དང་།
en: Nanda, after that, the śramaṇa is well established having observed the body in terms of the phenomena of origination, and he is well established having observed the phenomena of cessation.

source: འགོག་པའི་ཆོས་སུ་བལྟས་ནས་རབ་ཏུ་གནས་པ་ཡང་བྱེད་ལ་གཞན་ཡང་ཀུན་འབྱུང་བ་དང་།
en: Furthermore, he is well established observing the body in terms of both the phenomena of origination and cessation.

source: འགོག་པའི་ཆོས་གཉིས་ལ་ལུས་ཀྱི་རྗེས་སུ་ལྟ་ཞིང་གནས་པར་བྱེད་པ་ཉིད་ཀྱི་ལུས་འདི་ལ་ཡང་དག་པར་དྲན་པར་བྱེད་པས་རེས་འགའ་ནི་ཤེས་པ་ཁོ་ན་དང་ལྡན་པར་འགྱུར། རེས་འགའ་ནི་མཐོང་བ་ཁོ་ན་དང་ལྡན་པར་འགྱུར། རེས་འགའ་ནི་དྲན་པ་ཁོ་ན་དང་ལྡན་པར་འགྱུར་ཞིང་རྟེན་པ་མེད་པར་གནས་པར་འགྱུར་བས་འཇིག་རྟེན་འདི་ལ་བླང་བར་བྱ་བ་ཅི་ཡང་མེད་པར་རབ་ཏུ་ཤེས་པར་འགྱུར་ཏེ།
en: Since he is perfectly mindful with respect to this body of his, sometimes having only knowledge, sometimes having only vision, sometimes having only mindfulness, he dwells independently, and he knows well that there is nothing to be taken up in this world.

source: དེ་ལྟར་ན་དགའ་བོ་འདི་ནི་དགེ་སློང་བདག་ཉིད་ཀྱི་ནང་གི་ལུས་ལ་ལུས་ཀྱི་རྗེས་སུ་ལྟ་བ་ལ་གནས་པ་ཞེས་བྱ་སྟེ།
en: Therefore, Nanda, this is known as ‘the monk established in the observation of the body with respect to his own internal body.’

source: ཕྱི་རོལ་གྱི་ལུས་དང་། ནང་དང་ཕྱི་རོལ་གཉི་གའི་ལུས་ལ་ལྟ་བ་ཡང་དེ་བཞིན་ནོ། །
en: Observation with respect to the external body and both the internal and external bodies is similar.

source: དེའི་འོག་ཏུ་ནང་གི་ཚོར་བ་དང་། ཕྱི་རོལ་གྱི་ཚོར་བ་དང་། ནང་དང་ཕྱི་རོལ་གཉི་གའི་ཚོར་བར་ལྟ་བ་ལ་རབ་ཏུ་གནས་པ་དང་།
en: “After that, he is well established in observation with respect to internal feelings, external feelings, and feelings that are both internal and external.

source: ནང་གི་སེམས་དང་། ཕྱི་རོལ་གྱི་སེམས་དང་། ནང་དང་ཕྱི་རོལ་གཉི་གའི་སེམས་སུ་ལྟ་བ་ལ་གནས་པ་དང་།
en: And he is well established in observation with respect to internal thought, external thought, and thought that is both internal and external.

source: ནང་གི་ཆོས་དང་། ཕྱི་རོལ་གྱི་ཆོས་དང་།
en: And he is well established in observation with respect to internal dharmas, external dharmas, and dharmas that are both internal and external.

source: ནང་དང་ཕྱི་རོལ་གཉི་གའི་ཆོས་སུ་ལྟ་བ་ལ་རབ་ཏུ་གནས་ནས་བརྩོན་འགྲུས་ཀྱིས་དྲན་པ་རྩེ་གཅིག་ཏུ་བྱས་པས་ཡང་དག་པའི་ཤེས་པ་ཐོབ་ནས་འཇིག་རྟེན་པའི་ཁོང་ཁྲོ་བ་ཇི་སྙེད་པ་དག་རྟག་ཏུ་ཡིད་ལ་མི་སེམས་ཤིང་རབ་ཏུ་དུལ་བར་གྱུར་ནས་ཀུན་འབྱུང་བའི་ཆོས་སུ་བལྟས་ཏེ་རབ་ཏུ་གནས་པ་དང་།
en: Since he is diligently engaged in one-pointed mindfulness, he obtains perfect understanding, never has in mind whatever anger he has for the world, and is completely disciplined.

source: འགོག་པའི་ཆོས་སུ་བལྟས་ནས་རབ་ཏུ་གནས་པར་ཡང་བྱེད་ལ།
en: He is well established in observation with respect to the phenomena of origination, he is well established in observation with respect to the phenomena of cessation, and he is well established in observation with respect to both the phenomena of origination and cessation.

source: གཞན་ཀུན་འབྱུང་བ་དང་། འགོག་པའི་ཆོས་གཉིས་ལ་ཆོས་སུ་བལྟས་ནས་རབ་ཏུ་གནས་པར་བྱེད་པ་ཉིད་ཀྱིས་ལུས་འདི་ཉིད་ལ་ཡང་དག་པར་དྲན་པར་བྱེད་པས་རེས་འགའ་ནི་ཤེས་པ་ཁོ་ན་དང་ལྡན་པར་འགྱུར།
en: He is perfectly mindful with respect to this very body of his.

source: རེས་འགའ་ནི་མཐོང་བ་ཁོ་ན་དང་ལྡན་པར་འགྱུར། རེས་འགའ་ནི་དྲན་པ་ཁོ་ན་དང་ལྡན་པར་འགྱུར་བས་འཇིག་རྟེན་འདི་ལ་བླང་བར་བྱ་བ་ཅི་ཡང་མེད་པ་རབ་ཏུ་ཤེས་པར་འགྱུར་ཏེ།
en: Sometimes having only knowledge, sometimes having only vision, sometimes having only mindfulness, he dwells independently, and he knows well that there is nothing to be taken up in this world.

source: དེ་ལྟར་ན་དགའ་བོ་འདི་ནི་དགེ་སློང་བདག་ཉིད་གླིང་དུ་གྱུར་པ་དང་། བདག་ཉིད་གནས་དང་སྐྱབས་སུ་གྱུར་པ་དང་།
en: Therefore, Nanda, it is said that the monk is an island for himself; he is an abode and a refuge for himself.

source: ཆོས་གླིང་དུ་གྱུར་པ་དང་།
en: The Dharma is an island; the Dharma is an abode and a refuge.

source: ཆོས་གནས་དང་སྐྱབས་སུ་གྱུར་ཅིང་དེ་ལས་གཞན་པའི་གླིང་མེད་པ་དང་། དེ་ལས་གཞན་པའི་གནས་དང་སྐྱབས་མེད་པ་ཞེས་བྱའོ། །
en: There is no island other than that; there is no abode or refuge other than that.

source: དགའ་བོ་སྐྱེས་བུ་རང་བཞིན་དྲང་ཞིང་གཡོ་སྒྱུ་སྤངས་པ་གང་ལ་ལ་ཞིག་སྔ་དྲོའི་དུས་ཀྱི་ཚེ་ངའི་ཐད་དུ་འོངས་པ་ལ་ངས་དབང་པོ་ཇི་ལྟ་བ་བཞིན་དུ་དགེ་བའི་ཆོས་དེ་ལ་རྗེས་སུ་བསྟན་ནས་དེ་ཕྱི་དྲོའི་དུས་ཀྱི་ཚེ་བདག་ཉིད་ཐོབ་པ་དང་ལྡན་པ་སྨྲ་བར་གྱུར་ལ།
en: “Nanda, after I teach the virtuous Dharma, according to his abilities, to a person upright by nature, who has abandoned deceit, who has come into my presence in the morning, that person will say in the afternoon, ‘I have obtained realization!’

source: ཕྱི་དྲོའི་དུས་ཀྱི་ཚེ་ཆོས་རྗེས་སུ་བསྟན་པ་ཡང་བདག་ཉིད་ཐོབ་པ་དང་ལྡན་པར་སྨྲ་བར་བྱེད་པས་ན།
en: I cause him to be one who, in the afternoon, says ‘I have obtained realization’ of the Dharma that I have taught.

source: དགའ་བོ་ངས་ལེགས་པར་བསྟན་པའི་ཆོས་ནི་མཐོང་བའི་ཆོས་ལ་མངོན་སུམ་དུ་རྟོགས་པ་རབ་ཏུ་གདུང་བ་སེལ་བར་བྱེད་པ།
en: Therefore, Nanda, the Dharma that I have taught well is realized in this very life and removes torment.

source: དུས་དང་དབང་པོ་དང་རབ་ཏུ་འཚམ་པར་འགྱུར་བ།
en: It is appropriate to the occasion and to the capacity of the listener.

source: ཐབས་དང་ལྡན་པ་རང་གིས་རིག་པའི་ཆོས་ལེགས་པར་སྐྱོབ་པར་བྱེད་པ་ཡིན་པས་གང་གིས་ངའི་མངོན་སུམ་དུ་ཆོས་བསྟན་པ་ཐོས་པར་གྱུར་ན་མྱ་ངན་ལས་འདས་པའི་རྗེས་སུ་འཐུན་པར་འགྱུར་ཞིང་བྱང་ཆུབ་ལ་གཞོལ་བར་བྱེད་པ་གང་ཡིན་པ་འདི་ནི་ངའི་མཁྱེན་པ་ཡིན་ཏེ།
en: Since this Dharma, which is expedient and realized by oneself, offers protection, if someone hears the Dharma teaching in my presence, being in accord with nirvāṇa, the person will be inclined toward awakening. This I know.

source: དེ་ལྟ་བས་ན་དེང་ཁྱོད་ཀྱིས་བདག་གི་དོན་དང་གཞན་གྱི་དོན་དང་། གཉི་གའི་དོན་དེ་ལྟ་བུ་མཐོང་ནས་ཆོས་འདི་ལ་རྟག་པར་ཡང་དག་པར་བསླབས་ཏེ།
en: “Therefore, having now seen such benefit for oneself, for others, and for both, you should always train perfectly in this Dharma.

source: རབ་ཏུ་བྱུང་བའི་ཆོས་བག་ཡོད་པར་བསྒྲུབས་ནས་ཆུད་མི་གཟན་ཅིང་འབྲས་བུ་ཁྱད་པར་དུ་འཕགས་པ་འདུས་མ་བྱས་ཀྱི་བདེ་བ་ཐོབ་པར་བྱས་ནས་གཞན་གྱིས་བྱིན་པའི་ཆོས་གོས་དང་།
en: Having carefully established the qualities of one gone forth, without forgetting anything, you will obtain the exalted result of unconditioned happiness.

source: བསོད་སྙོམས་དང་། མལ་ཆ་དང་། ན་བའི་གསོས་སྨན་ལ་སོགས་པ་བླང་བར་བྱ་ཞིང་སྦྱིན་པ་དག་རྣམས་བསོད་ནམས་ཀྱི་ཕན་ཡོན་ཆེན་པོ་ཐོབ་པ་དང་།
en: You will accept from others robes, alms, bedding, medicines for illness, and so forth, and the donors will obtain the great benefits and advantages of merit.

source: འབྲས་བུ་རྣམ་པར་སྨིན་པ་ཁྱད་པར་དུ་འཕགས་པ་ཡངས་ཤིང་རྒྱ་ཆེ་བདག་འཐོབ་པར་འགྱུར་བར་དེ་ལྟར་དགའ་བོ་ཁྱོད་ཀྱིས་བསླབ་པར་བྱའོ། །
en: To obtain the vastness and greatness of this exalted ripened result, Nanda, you should train in this way.

source: གཞན་ཡང་དགའ་བོ་གཟུགས་འགའ་ཙམ་ཡང་རྗེས་སུ་ཆགས་པར་བྱ་བ་འམ། མ་འོངས་པའི་དུས་ན་རྣམ་པར་འགྱུར་ཞིང་འཇིག་པར་མི་འགྱུར་བ་གང་ཡང་མེད་དེ་དེའི་གནས་མེད་དོ། །
en: “Furthermore, Nanda, there is no rūpa that is desirable or that will not, in the future, change and perish; that is impossible.

source: གང་ཡང་མྱ་ངན་དང་སྨྲེ་སྔགས་འདོན་པ་དང་ཉོན་མོངས་པ་མི་སྐྱེད་པ་གང་ཡང་མེད་དེ་དེའི་གནས་མེད་དོ། །
en: There is nothing whatsoever that does not give rise to sorrow, lamentation, and affliction; that is impossible.

source: དགའ་བོ་འདི་ཇི་སྙམ་དུ་སེམས།
en: Nanda, what do you think?

source: གཟུགས་དེ་རྟག་པ་ཞིག་ཡིན་ནམ།
en: Is rūpa permanent?

source: འོན་ཏེ་མི་རྟག་པ་ཞིག་ཡིན་བཙུན་པ་དེ་ནི་རང་བཞིན་གྱིས་མི་རྟག་པ་ལགས་སོ། །
en: Or is it impermanent?” “Venerable one, it is impermanent by nature.”

source: དགའ་བོ་གལ་ཏེ་རང་བཞིན་གྱིས་མི་རྟག་པ་ཡིན་ན་ཅི་དེ་བདེ་བ་ཅིག་ཡིན་ནམ།
en: “Nanda, if it is impermanent by nature, is it happiness or is it suffering?”

source: འོན་ཏེ་སྡུག་བསྔལ་བ་ཞིག་ཡིན་བཙུན་པ་དེ་ནི་སྡུག་བསྔལ་བ་ལགས་སོ། །
en: “Venerable one, it is suffering.”

source: གང་མི་རྟག་ཅིང་སྡུག་བསྔལ་བ་དེ་ནི་རྣམ་པར་འགྱུར་ཞིང་འཇིག་པའི་ཆོས་ཅན་ཡིན་ན་ངའི་ཉན་ཐོས་འཕགས་པ་མང་དུ་ཐོས་པ་དང་ལྡན་པ་དག་ཅི་གཟུགས་འདི་ནི་བདག་ཡིན་ནོ། །བདག་ནི་གཟུགས་རྣམས་དང་ལྡན་ནོ། གཟུགས་ནི་བདག་གི་ཡིན་ནོ། །བདག་ནི་གཟུགས་ལ་གནས་སོ་ཞེས་ཁས་ལེན་པར་བྱེད་དམ།
en: “If something that is impermanent and suffering is subject to change and perishing, do my noble, learned śrāvakas assert that rūpa is the self, that the self has rūpa, that rūpa belongs to the self, or that the self dwells in rūpa?”

source: གསོལ་པ་བཅོམ་ལྡན་འདས་དེ་ནི་མ་ལགས་སོ། །
en: “Bhagavān, no, they do not,” replied Nanda.

source: འདི་ཇི་སྙམ་དུ་སེམས།
en: “What do you think, are vedanā, saṃjñā, saṃskāra, and vijñāna permanent?

source: ཅི་ཚོར་བ་དང་།
en: Or are they impermanent?”

source: འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། །རྣམ་པར་ཤེས་པ་དེ་དག་རྟག་པ་ཞིག་ཡིན་ནམ་འོན་ཏེ་མི་རྟག་པ་ཞིག་ཡིན་བཙུན་པ་ཐམས་ཅད་རང་བཞིན་གྱིས་མི་རྟག་པ་ལགས་སོ། །
en: “Venerable one, they are all impermanent by nature.”

source: དགའ་བོ་ག་ལ་ཏེ་རང་བཞིན་གྱིས་ཡིན་ན་ཅི་བདེ་བ་ཞིག་ཡིན་ནམ།
en: “Nanda, if they are impermanent by nature, are they happiness or are they suffering?”

source: འོན་ཏེ་སྡུག་བསྔལ་བ་ཞིག་ཡིན་བཙུན་པ་བསྔལ་བ་ལགས་སོ། །
en: “Venerable one, they are suffering.”

source: གང་མི་རྟག་ཅིང་སྡུག་བསྔལ་བ་དེ་ནི་རྣམ་པར་འགྱུར་ཞིང་འཇིག་པའི་ཆོས་ཅན་ཡིན་ན། ངའི་འཕགས་པ་ཉན་ཐོས་མང་དུ་ཐོས་པ་དང་ལྡན་པ་དག་ཅི་ཚོར་བ་ལ་སོགས་པ་འདི་དག་ནི་བདག་ཡིན་ནོ། བདག་ནི་ཚོར་བ་ལ་སོགས་པ་དང་ལྡན་ནོ། །ཚོར་བ་ལ་སོགས་པ་ནི་བདག་གི་ཡིན་ནོ། །བདག་ནི་ཚོར་བ་ལ་སོགས་པ་ལ་གནས་སོ་ཞེས་ཁས་ལེན་པར་བྱེད་དམ།
en: “If something that is impermanent and suffering is subject to change and perishing, do my noble, learned śrāvakas assert that vedanā and so forth are the self, that the self has vedanā and so forth, that vedanā and so forth belong to the self, or that the self dwells in vedanā and so forth?”

source: བཅོམ་ལྡན་འདས་དེ་ནི་མ་ལགས་སོ། །དེ་ལྟ་བས་ན་ཇི་ཙམ་དུ་གཟུགས་སུ་གྱུར་པ་འདས་པའམ། མ་འོངས་པའམ། ད་ལྟར་བྱུང་བའམ། ནང་གི་འམ། ཕྱི་རོལ་གྱི་འམ། རགས་པའམ། ཕྲ་བའམ། བཟང་པོའམ། ངན་པའམ།
en: “Bhagavān, no, they do not.”

source: ཐག་རིང་བའམ། ཐག་ཉེ་བ་ཡང་རུང་སྟེ། ཇི་ཙམ་དུ་གཟུགས་སུ་གྱུར་པ་ཐམས་ཅད་ཀྱང་བདག་མ་ཡིན་ལ་བདག་ཀྱང་གཟུགས་དང་ལྡན་པ་མ་ཡིན་པ་དང་། གཟུགས་ཀྱང་བདག་མ་ཡིན་ལ། བདག་ཀྱང་གཟུགས་ལ་གནས་པ་མ་ཡིན་པར་རིག་པར་བྱའོ། །
en: “Therefore, it should be understood that everything that is rūpa, whether past, future, or present, internal or external, coarse or subtle, good or bad, far or near, is not the self; the self does not have rūpa, rūpa does not belong to the self, and the self does not dwell in rūpa.

source: དེ་བཞིན་དུ་ཡང་དག་པའི་དྲན་པ་དང་ཡང་དག་པའི་ཤེས་རབ་ཀྱིས་ཇི་ཙམ་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པར་གྱུར་པ་འདས་པའམ། མ་འོངས་པའམ། ད་ལྟར་བྱུང་བའམ། ནང་གིའམ། ཕྱི་རོལ་གྱི་འམ། རགས་པའམ། ཕྲ་བའམ། བཟང་པོའམ། ངན་པའམ། ཐག་རིང་བ་འཐག་ཉེ་བ་ཡང་རུང་སྟེ། དེ་དག་ཐམས་ཅད་ཀྱང་བདག་མ་ཡིན་ལ་བདག་ཀྱང་དེ་དག་དང་ལྡན་པ་མ་ཡིན་པ་དང་། དེ་དག་ཀྱང་བདག་གི་མ་ཡིན་ལ། བདག་ཀྱང་ངེ་དག་ལ་གནས་པ་མ་ཡིན་པར་ལེགས་པར་སོ་སོར་བརྟག་པར་བྱའོ།
en: “Similarly, one should contemplate well, with perfect mindfulness and perfect wisdom, that everything that is vedanā, saṃjñā, saṃskāra, and vijñāna, whether past, future, or present, internal or external, coarse or subtle, good or bad, far or near, is not the self; the self does have them, they do not belong to the self, and the self does not dwell in them.

source: དེ་བཞིན་དུ་ཡང་དག་པའི་དྲན་པ་དང་ཡང་དག་པའི་ཤེས་རབ་ཀྱིས་ངའི་ཉན་ཐོས་འཕགས་པ་མང་དུ་ཐོས་པ་དང་ལྡན་པ་དག་ནི་འདི་ལྟར་གཟུགས་ལ་སོ་སོར་བརྟགས་ནས་ཡོངས་སུ་སྐྱོ་བ་སྐྱེ་བ་དང་གཞན་ཡང་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ལ་སོ་སོར་བརྟགས་ནས་ཡོངས་སུ་སྐྱོ་བ་སྐྱེ་བར་འགྱུར་རོ། །
en: Similarly, with perfect mindfulness and perfect wisdom, having contemplated physical form in this way and having given rise to disillusionment, my noble, learned śrāvakas also contemplate vedanā, saṃjñā, saṃskāra, and vijñāna and give rise to disillusionment.

source: གལ་ཏེ་སྐྱོ་བར་གྱུར་ན་མངོན་པར་ཞེན་པར་མི་བྱེད་དོ། །
en: If they become disillusioned, they will not be attached.

source: མངོན་པར་ཞེན་པ་མེད་པས་རྣམ་པར་གྲོལ་བ་ཐོབ་པར་འགྱུར་རོ། །
en: Since there is no attachment, they will obtain liberation.

source: རྣམ་པར་གྲོལ་ནས་བདག་རྣམ་པར་གྲོལ་ལོ་སྙམ་དུ་ཤེས་པས་འདི་སྐད་དུ་བདག་གི་སྐྱེ་བ་ནི་ཟད་དོ། །
en: Liberated, they know, ‘I am liberated,’ and therefore they declare, ‘Rebirth is finished.

source: ཚངས་པར་སྤྱོད་པ་ཡང་དག་པར་སྤྱད་དོ། །
en: I have perfectly practiced pure conduct.

source: བྱ་བ་བྱས་པས་ཡང་སྲིད་པ་ཕྱི་མ་ལེན་པར་མི་འགྱུར་རོ་ཞེས་སྒྲོགས་པར་འགྱུར་རོ་སྙམ་དུ་སོ་སོར་བརྟག་པར་བྱའོ། །
en: Since I have done what had to be done, I will not take birth again.’ One should contemplate in this way.”

source: དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བཀའ་སྩལ་པ་ན། ཚེ་དང་ལྡན་པ་དགའ་བོ་རྡུལ་སྤངས་ཤིང་དྲི་མ་དང་བྲལ་ནས་ཆོས་ཀྱི་མིག་རྣམ་པར་དག་པ་ཐོབ་པར་གྱུར་ཏོ། །
en: At that time, when the Bhagavān spoke this Dharma discourse, the venerable Nanda, having eliminated dust and been freed from defilement, obtained the pure Dharma eye.

source: དགེ་སློང་ལྔ་བརྒྱ་པོ་རྣམས་ནི་ཟག་པ་རྣམས་ལས་སེམས་རྣམ་པར་གྲོལ་བ་ཐོབ་པར་གྱུར་ཏོ། །
en: The five hundred monks obtained liberation of the mind from outflows.

source: དེ་ནས་དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་ཡང་ཚིགས་སུ་བཅད་དེ་དགའ་བོ་ལ་བཀའ་སྩལ་པ། གང་ལ་མཉམ་བཞག་སེམས་མེད་པས། །རྣམ་དག་ཡེ་ཤེས་མེད་པས་ན། །ཟག་པ་རྣམས་ནི་སྤོང་མི་འགྱུར། །
en: Then the Bhagavān spoke these verses to Nanda: “If a person, not having a mind in equipoise, Lacks pure wisdom, They will not abandon outflows.

source: དེ་བས་ཁྱོད་ཀྱིས་ནན་ཏན་བསྒྲུབས། །
en: Therefore, you should practice earnestly.

source: ཁྱོད་ཀྱིས་རྣལ་འབྱོར་རྟག་སྒོམས་ལ། །ཕུང་པོ་སྐྱེ་འགག་ཤེས་པར་གྱིས། །
en: “Always cultivate yoga and Know the arising and cessation of the skandhas.

source: རྣམ་དག་གལ་ཏེ་རྫོགས་གྱུར་ན། །ལྷ་རྣམས་ཀུན་ནི་དགའ་བར་འགྱུར། །
en: If purity is complete, All the gods will rejoice.

source: མཛའ་བཤེས་ལྷན་ཅིག་འབྲེལ་དགའ་ཞིང་། །ཕན་ཚུན་འདྲུལ་ཞིང་ཆགས་པ་དང་། །ཐོབ་དང་གྲགས་པ་མངོན་ཞེན་པ། །དགའ་བོ་ཁྱོད་ཀྱིས་ཀུན་སྤོངས་ཤིག །
en: “Happiness at being with friends and relatives, Mutually going back and forth and fondness, Attachment to profit and fame— Nanda, you must abandon all of this.

source: ཁྱིམ་པ་དང་ནི་རབ་བྱུང་ལ། །བསྟེན་ཅིང་བཤེས་ནི་མ་བྱེད་པར། །
en: “As for householders and monks, Do not associate or make friends with them.

source: འཁོར་བའི་རྒྱ་མཚོ་འདའ་སོམས་ལ། །སྡུག་བསྔལ་མཐར་ནི་ཕྱིན་པར་བྱོས། །
en: Mindful of going beyond the ocean of saṃsāra, Reach the end of suffering.

source: དང་པོ་མེར་མེར་པོ་ལས་ནི། །ཤ་ཡི་ཆུ་བུར་སྐྱེ་བར་འགྱུར། །
en: “First, from the kalala, A bubble of flesh (arbuda) arises.

source: ཆུ་བུར་ལས་ནི་ལྟར་ལྟར་སྐྱེ། །
en: From the bubble, a lump (peśī) arises.

source: ལྟར་ལྟར་པོ་ལས་མཁྲང་བར་འགྱུར། །
en: After the lump, it becomes hard (ghana).

source: མཁྲང་བ་རྣམ་པར་གྱུར་ནས་ནི། །མགོ་དང་ཡན་ལག་བཞི་སྐྱེ་བས། །
en: “After it becomes hard, The head and four limbs arise.

source: རུས་པ་འདུས་ནས་ལུས་གྲུབ་པ། །
en: After the bones are assembled, the body is complete.

source: ཐམས་ཅད་ལས་ཀྱི་རྒྱུ་ལས་བྱུང་། །
en: All arises from karmic causes.

source: མགོ་ཐོད་རུས་པ་དགུ་འདུས་ཤིང་། །
en: “The skull consists of nine bones.

source: འགྲམ་པའི་རུས་པ་གཉིས་འབྲེལ་ཏེ། །
en: The two jawbones are connected.

source: སོ་ནི་སུམ་ཅུ་རྩ་གཉིས་ལྡན། །དེ་ཡི་རྩ་བའང་དེ་བཞིན་ནོ། །
en: As for teeth, there are thirty-two, Their roots likewise.

source: རྣ་རྩ་གཉའ་བའི་རུས་པ་དང་། །རྐན་དང་སྣ་ཡི་རུས་པ་དང་། །བྲང་དང་མིད་པའི་རུས་པ་ནི། །བསྡུས་ན་རུས་པ་ཉི་ཤུ་ཡོད། །
en: “The bones at the base of the ears and the neck, The bones of the palate and the nose, The breastbone and bones of the throat— Altogether there are twenty bones.

source: མིག་ལ་རུས་པ་བཞི་ཡོད་དེ། །
en: “There are four bones in the eye sockets.

source: ཕྲག་པ་བྱིན་པ་ཟུང་གཉིས་ཡོད། །
en: There are two pairs of shoulder bones and calf bones.

source: ལག་པ་གཉིས་དང་སོར་མོ་རྣམས། །བསྡུས་ན་རུས་པ་ལྔ་བཅུ་ཡོད། །
en: The two hands and fingers Altogether have fifty bones.

source: ལྟག་རྒྱབ་རུས་པ་བརྒྱད་ཡོད་དེ། །
en: “The back of the neck has eight bones.

source: སྒལ་ཚིགས་ལ་ནི་སུམ་ཅུ་གཉིས། །
en: There are thirty-two in the spine.

source: འདི་དག་ཀུན་ལ་རྩ་ཡོད་པས། །དེ་ཡི་གྲངས་ནི་ཆ་བཞིར་འགྱུར། །
en: Since these all have roots, Their enumeration is four times thirty-two.

source: རྩིབ་ལོགས་གཡས་པའི་རུས་པ་ནི། །ཕན་ཚུན་འབྲེལ་པ་བཅུ་གསུམ་ཡོད། །
en: “As for the bones on the right side, Thirteen are connected to one another.

source: རྩིབ་ལོགས་གཡོན་འབྲེལ་སྐྱེ་བ་ཡི། །རུས་པ་དག་ནི་བཅུ་གསུམ་ཡོད། །
en: There are thirteen bones that Arise connected on the left side.

source: རུས་པའི་ལུ་གུ་རྒྱུད་འདི་དི་དག །གསུམ་གསུམ་དག་ནི་ཕན་ཚུན་འབྲེལ། །
en: “These chains of bones Are connected three by three.

source: གཉིས་གཉིས་དག་ནི་ཚིགས་ལྡན་ཏེ། །
en: When two by two, they have joints.

source: ལྷག་མ་གཞན་ནི་འབྲེལ་པ་མེད། །
en: The remaining ones are not connected.

source: གཡས་གཡོན་བརླ་ནི་གཉིས་པོ་ལ། །བསྡུས་ན་རུས་པ་ལྔ་བཅུ་ཡོད། །
en: “In both the right and left thighs, Altogether there are fifty bones.

source: ལུས་ནང་འབྲེལ་པའི་རུས་པ་ནི། །བསྡོམས་ན་སུམ་བརྒྱ་དྲུག་ཅུ་ཡོད། །
en: As for bones that connect the inside of the body, In total, there are three hundred and sixty.

source: རུས་ཚིགས་ཕན་ཚུན་འབྲེལ་ན་ནི། །སེམས་ཅན་ལུས་ནི་གྲུབ་ཡིན་ཞེས། །
en: “When the bones and the joints connect to each other, The being’s body is said to be complete.

source: ཡང་དག་སངས་རྒྱས་མཁྱེན་པ་ཡིས། །བདེན་ཚིག་ཏུ་ནི་གསུངས་པ་ཡིན། །
en: The perfect Buddha, with his wisdom, Has said so in his true words.

source: རྐང་མཐིལ་ནས་ནི་མགོ་ཡི་བར། །མི་གཙང་འདྲེས་ཤིང་མི་བརྟན་པ། །
en: “From the soles of the feet up to the head, It is contaminated with filth and unstable.

source: དེ་དག་ལྷན་ཅིག་ལུས་བསྒྲུབས་པས། །ཉམ་ཆུང་འདམ་བུའི་ཁྱིམ་དང་འདྲ། །
en: Since they together form the body, It is fragile like a house of reeds.

source: རུས་པ་འབའ་ཞིག་གཟེར་བུ་མེད། །ཤ་ཁྲག་ཀུན་ཏུ་བསྐུས་པས་ན། །མི་གཙང་འཁྲུལ་འཁོར་རབ་འདྲ་ཞིང་། །
en: “Only bones, without dowels— Since it is smeared all over with flesh and blood, It resembles a wooden puppet Or a magically conjured image.

source: སྒྱུ་མས་སྤྲུལ་པའི་གཟུགས་བརྙན་འདྲ། །ལུས་འདི་རྩ་རྒྱུས་དཀྲིས་ནས་ནི། །པགས་པ་གཤེར་བས་གཡོགས་པས་ན། །གནས་དགུ་རྨ་ཡི་སྒོ་ཡོད་པར། །དེ་ལྟ་བུར་ནི་བལྟ་བར་བྱ། །
en: “This body, bound with ligaments, Covered by damp skin, With orifices like wounds in nine places, Should be seen like that.

source: ཀུན་ནས་གཅིན་སྐྱག་མི་གཙང་བ། །རྟག་ཏུ་གང་ཞིང་འཛག་པས་ན། །དཔེར་ན་བང་བ་རྡོལ་རྣམས་སུ། །འབྲུ་རྣམས་སྣ་ཚོགས་བཀང་བ་ལྟར། །
en: “Everywhere it is always full to the brim and leaking Urine, excrement, and filth, Just as bursting storehouses Are filled up with various grains.

source: ལུས་འདི་ཡང་ནི་དེ་བཞིན་ཏེ། །མི་གཙང་སྣ་ཚོགས་རབ་ཏུ་གང་། །
en: “This body is also like this: Absolutely full of various kinds of filth.

source: རུས་པའི་འཁྲུལ་འཁོར་གཡོ་བས་ན། །ཉམ་ཆུང་སྙིང་པོ་ཅི་ཡང་མེད། །
en: A mechanism of bones, it wavers, Weak and without any substance.

source: བྱིས་པའི་སྐྱེ་བ་རྟག་ཏུ་ཆགས། །མཁས་པ་དག་ནི་ཞེན་མི་བྱེད། །མཆིལ་སྣབས་རྔུལ་ནི་རྟག་ཏུ་འབབ། །རྣག་ཁྲག་དག་གིས་རྒྱུན་ཏུ་གང་། །
en: “Foolish beings constantly lust; The wise do not get attached.

source: ཞག་སེར་འོ་མ་ལྷན་ཅིག་འདྲེས། །ཀླད་རྒྱས་དག་ནི་ཀླད་པས་གང་། །སྙིང་གར་བད་ཀན་རྒྱུན་ཏུ་འབྱུང་། །ནང་གི་ཞུ་དང་མ་ཞུའི་གནས། །ཀླད་རྒྱས་དང་ནི་པགས་པ་དང་། །སྙིང་དང་ནང་གྲོལ་གློ་མཆིན་དང་། །འདི་ལ་སོགས་པའི་རུལ་མྱགས་དང་། །
en: Spit, snot, and sweat constantly flowing; Continuously filled with pus and blood; “Yellow fat, mixed with milk; The head, filled with brains; Phlegm produced in the chest in a stream; The stomach and intestines inside; “Brains and skin, Heart, entrails, lungs, and liver— These and other putrid and Unclean things exist together.

source: མི་གཙང་རྣམས་དང་ལྷན་ཅིག་གནས། །སྡིག་པའི་ལུས་ནི་འཇིགས་རུང་པས། །འདི་ཉིད་བདག་གི་དགྲ་ཡིན་ན། །
en: “Since the sinful body is frightful, It is my enemy.

source: ཤེས་མེད་འདོད་ལ་ཞེན་པ་ཡི། །བླུན་པོ་རྟག་ཏུ་ཕངས་པར་བྱེད། །
en: Those lacking wisdom and attached to sense objects, Fools, always hold it dear.

source: འདི་འདྲའི་མི་གཙང་ལུས་འདི་ནི། །གྲོང་ཁྱེར་རྙིང་པ་འདྲ་བས་ན། །ཉིན་མཚན་ཉོན་མོངས་རབ་གཟིར་ཅིང་། །སྐད་ཅིག་མི་གནས་ཀུན་ཏུ་འཁྱམས། །
en: “This impure body, which is like this, Since it is like a decrepit city, So tormented, day and night, by afflictions, Wanders everywhere, not staying still for a moment.

source: རུས་པས་གྲོང་ཁྱེར་རྩིག་པར་བྱེད། །
en: “Bones act as the city wall.

source: ཤ་དང་ཁྲག་གིས་ཞལ་ཞལ་བསྐུས། །
en: It is plastered with flesh and blood.

source: འདོད་སྡང་གཏི་མུག་ཚོན་བཀྱེ་ནས། །ཅི་རིགས་པར་ནི་རྒྱན་པར་བྱེད། །
en: Colored by lust, aversion, and ignorance, It is embellished in all manner of ways.

source: རུས་པའི་གྲོང་ཁྱེར་སྐྱུག་བྲོ་བ། །ཤ་ཁྲག་འབྲེལ་ཅིང་འདུས་པས་པས་ན། །རྟག་ཏུ་སྡུག་པའི་གྲོགས་པོ་ཡིས། །ཕྱི་ནང་སྡུག་བསྔལ་གདུང་བར་བྱེད། །
en: “This nauseating city of bones, Since it is a composite of flesh and blood joined together, By beloved friends is always Tormented with inner and outer suffering.

source: དགའ་བོ་ཁྱོད་ཀྱིས་ཤེས་པར་བྱོས། །ངས་ནི་ཇི་སྐད་བསྟན་པ་བཞིན། །
en: “Nanda, you should understand Just as I have declared.

source: ཉིན་མཚན་རྟག་ཏུ་དྲན་བྱོས་ལ། །
en: Always remember, day and night.

source: འདོད་པའི་ཡུལ་ལ་སེམས་མ་བྱེད། །
en: Do not think about objects of desire.

source: གལ་ཏེ་འདོད་པ་སྤོང་འདོད་ན། །རྟག་ཏུ་དེ་བཞིན་རབ་སྒོམས་ལ། །
en: “If you wish to renounce desire, Always meditate well in this way.

source: རྣམ་གྲོལ་ཡོངས་སུ་བཙལ་བར་གྱིས། །
en: You should pursue liberation.

source: མྱུར་དུ་འཁོར་བའི་རྒྱ་མཚོ་འདའ། །
en: Quickly cross over the ocean of saṃsāra.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་མངལ་དུ་འཇུག་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བཀའ་སྩལ་པ་ན། ཚེ་དང་ལྡན་པ་དགའ་བོ་དང་། དགེ་སློང་ལྔ་བརྒྱ་པོ་དེ་དག་རབ་ཏུ་དགའ་བར་གྱུར་པས་བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ། །
en: When the Bhagavān spoke this Dharma discourse, “The Entry into the Womb,” the venerable Nanda and those five hundred monks were overjoyed, and they praised what the Bhagavān had taught.
